export const TermsOfUse = () => {
  return (
    <div className="py-10 px-20">
      <h1 className="text-xl font-bold">
        СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ КЛИЕНТОВ
      </h1>
      <p className="py-5">
        Пользователь, оставляя заявку на интернет-сайте (mps), принимает
        настоящее Согласие на обработку персональных данных (далее – Согласие).
        Действуя свободно, своей волей и в своем интересе, а также подтверждая
        свою дееспособность, Пользователь дает свое согласие ООО «МПС» (ИНН
        9310000582, ОГРН 1229300131290, адрес 287501, г.о. Мариуполь, г.
        Мариуполь, проспект Ленина, 68Б) на обработку своих персональных данных
        со следующими условиями:
      </p>
      <ul>
        <li>
          1. Данное Согласие дается на обработку персональных данных, как без
          использования средств автоматизации, так и с их использованием.
        </li>
        <li>
          2. Согласие дается на обработку следующих моих персональных данных:
          <ul className="ml-4">
            <li>
              2.1. Персональные данные, не являющиеся специальными или
              биометрическими: ФИО, номера контактных телефонов; адреса
              электронной̆ почты; место работы и занимаемая должность;
              пользовательские данные (файлы-cookies, сведения о действиях,
              которые совершаются пользователем, сведения об используемых для
              этого устройствах, дата и время сессии, с использованием
              метрических программ в автоматическом режиме).
            </li>
          </ul>
        </li>
        <li>3. Персональные данные не являются общедоступными.</li>
        <li>
          4. Цель обработки персональных данных:
          <ul className="ml-4">
            <li>
              4.1. обработка входящих запросов физических лиц с целью оказания
              консультирования;
            </li>
            <li>
              4.2. для заключения и исполнения договора, стороной которого либо
              выгодоприобретателем или поручителем по которому является субъект
              персональных данных;
            </li>
            <li>
              4.3. аналитики действий физического лица на веб-сайте и
              функционирования веб-сайта;
            </li>
            <li>4.4. проведение рекламных и новостных рассылок.</li>
          </ul>
        </li>
        <li>
          5. В случае необходимости предоставления моих персональных данных
          третьим лицам в целях надлежащего исполнения своих обязательств передо
          мной компанией ООО «МПС», я даю согласие на передачу им моих
          персональных данных. ООО «МПС» вправе поручить обработку моих
          персональных данных третьей стороне на основании заключаемого с этой
          стороной договора, (далее – поручение). Третья сторона, осуществляющая
          обработку персональных данных по поручению ООО «МПС», обязана
          соблюдать принципы и правила обработки персональных данных,
          предусмотренные ФЗ-152, обеспечивая конфиденциальность и безопасность
          при их обработке.
        </li>
        <li>
          6. Основанием для обработки персональных данных является:
          <ul className="ml-4">
            <li>6.1. ст. 24 Конституции Российской Федерации;</li>
            <li>
              6.2. ст. 6 Федерального закона №152-ФЗ «О персональных данных»;
            </li>
            <li>6.3. Настоящее согласие на обработку персональных данных.</li>
          </ul>
        </li>
        <li>
          7. Под обработкой персональных данных понимаются любые действия,
          совершаемые Исполнителем с использованием средств автоматизации или
          без использования таких средств с персональными данными, включая сбор,
          запись, систематизацию, накопление, хранение, уточнение (обновление,
          изменение), извлечение, использование, передачу, обезличивание,
          блокирование, удаление, уничтожение персональных данных, в том числе в
          информационных системах ООО «МПС».
        </li>
        <li>
          8. Способы и принципы обработки персональных данных, права и
          обязанности Сторон, а также перечень мер, применяемых Исполнителем в
          целях обеспечения безопасности персональных данных при их обработке
          указаны в Политике в отношении обработки персональных данных компании
          (см. ниже)
        </li>
        <li>
          9. Персональные данные обрабатываются до отписки физического лица от
          рекламных и новостных рассылок. Также обработка персональных данных
          может быть прекращена по запросу субъекта персональных данных.
          Хранение персональных данных, зафиксированных на бумажных носителях
          осуществляется согласно Федеральному закону №125-ФЗ «Об архивном деле
          в Российской Федерации» и иным нормативно правовым актам в области
          архивного дела и архивного хранения.
        </li>
        <li>
          10. Согласие может быть отозвано субъектом персональных данных или его
          представителем путем направления письменного заявления ООО «МПС» по
          адресу, указанному в начале данного Согласия, либо путем направления
          обращения на электронный адрес: metal-center.mps@mail.ru
        </li>
        <li>
          11. В случае отзыва субъектом персональных данных или его
          представителем согласия на обработку персональных данных ООО «МПС»
          вправе продолжить обработку персональных данных без согласия субъекта
          персональных данных при наличии оснований, указанных в пунктах 2 – 11
          части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального
          закона №152-ФЗ «О персональных данных» от 27.07.2006 г.
        </li>
        <li>
          12. Настоящее согласие действует в течение 5 лет с момента получения
          указанного согласия, либо до момента прекращения обработки
          персональных данных, указанных в п.9 и п.10 данного Согласия.
        </li>
      </ul>
    </div>
  );
};
